dananjayavr/stm32g031k8-4x4_matrix_keyboard/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KB_LED_4_Pin GPIO_PIN_9
#define KB_LED_4_GPIO_Port GPIOB
#define T_NRST_Pin GPIO_PIN_2
#define T_NRST_GPIO_Port GPIOF
#define KB_LED_2_Pin GPIO_PIN_0
#define KB_LED_2_GPIO_Port GPIOA
#define T_VCP_TX_Pin GPIO_PIN_2
#define T_VCP_TX_GPIO_Port GPIOA
#define T_VCP_RX_Pin GPIO_PIN_3
#define T_VCP_RX_GPIO_Port GPIOA
#define ROW_2_Pin GPIO_PIN_6
#define ROW_2_GPIO_Port GPIOA
#define ROW_1_Pin GPIO_PIN_7
#define ROW_1_GPIO_Port GPIOA
#define COL_2_Pin GPIO_PIN_1
#define COL_2_GPIO_Port GPIOB
#define COL_4_Pin GPIO_PIN_9
#define COL_4_GPIO_Port GPIOA
#define LD3_Pin GPIO_PIN_6
#define LD3_GPIO_Port GPIOC
#define COL_3_Pin GPIO_PIN_10
#define COL_3_GPIO_Port GPIOA
#define ROW_3_Pin GPIO_PIN_11
#define ROW_3_GPIO_Port GPIOA
#define ROW_4_Pin GPIO_PIN_12
#define ROW_4_GPIO_Port GPIOA
#define T_JTMS_Pin GPIO_PIN_13
#define T_JTMS_GPIO_Port GPIOA
#define T_JTCK_Pin GPIO_PIN_14
#define T_JTCK_GPIO_Port GPIOA
#define COL_1_Pin GPIO_PIN_15
#define COL_1_GPIO_Port GPIOA
#define KB_LED_1_Pin GPIO_PIN_4
#define KB_LED_1_GPIO_Port GPIOB
#define KB_LED_3_Pin GPIO_PIN_5
#define KB_LED_3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
